src/Enums/ТЦТипКлиентскогоПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТЦТипКлиентскогоПриложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АгентТЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеТестом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТЦСтатусСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТЦСтатусСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТЦТипОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТЦТипОбработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внешняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТЦТипАутентификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТЦТипАутентификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аутентификация1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АутентификацияОС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТЦТипКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТЦТипКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тонкий1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТонкийВеб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Веб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолстыйУправляемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолстыйОбычный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ТЦСценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТЦСценарии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлительностьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаПослеЗапускаВРМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокЗапускаКлиентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутЗагрузкиСценарияКлиентом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутЗаписиРезультатов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутЗапускаКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутИнициализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутОпросаКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутПодготовки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутУдаленияДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Структура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТЦРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТЦПользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТЦКлиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ТЦАгенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТЦАгенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦКомпьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСессии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ТЦВП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТЦВП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦКомпьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦРоли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦКлиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСессии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТЦСостояние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работоспособен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжатьРаботуМеждуИтерациями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ТЦКлиент/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ОСНОВНЫЕ КОМАНДЫ

// Выполнить тестирование
//
Процедура ВыполнитьТестирование() Экспорт
	
	ОткрытьФорму("Справочник.ТЦСценарии.ФормаСписка");
	
КонецПроцедуры // ВыполнитьТестирование()

// Переключить Тест-центр в режим агента
//
Процедура ВключитьРежимАгента(ПредыдущаяФорма = Неопределено) Экспорт
	
	Если ПредыдущаяФорма = Неопределено Тогда
		ИмяПредыдущейФормы = "Справочник.ТЦАгенты.ФормаСписка";
	Иначе
		ИмяПредыдущейФормы = ПредыдущаяФорма;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("", );
	ПараметрыФормы.Вставить("ПредыдущаяФорма", ИмяПредыдущейФормы);
	
	Попытка
		ТЦСервер.УстановитьТипКлиентскогоПриложения(ПредопределенноеЗначение("Перечисление.ТЦТипКлиентскогоПриложения.АгентТЦ"));
		ОткрытьФорму("Справочник.ТЦАгенты.Форма.Агент", ПараметрыФормы,,, ОсновноеОкно());
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "Ошибка при переходе в режим агента", ПредопределенноеЗначение("Перечисление.ТЦСтатусСообщения.Ошибка"));
		ВызватьИсключение "Произошла ошибка при переходе в режим агента."
						  "Подробную информацию об ошибке можно найти"
						  "в журнале регистрации по событию"
						  """Ошибка при переходе в режим агента""";
	КонецПопытки;
	
	УстановитьЗаголовокПриложения("Агент");
	
КонецПроцедуры // ВключитьРежимАгента()

// Переключить Тест-центр в режим ВРМ
//
Процедура ВключитьРежимВРМ(Клиент, Пользователь, ВП, ЛокальныйАдрес) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Форма = Справочники.ТЦВП.ПолучитьФорму("ОбычноеВРМ");
		Форма.Клиент = Клиент;
		Форма.Пользователь = Пользователь;
		Форма.ВП = ВП;
		Форма.ЛокальныйАдрес = ЛокальныйАдрес;
		Форма.Открыть();
	#Иначе
		П = Новый Структура;
		П.Вставить("Клиент", Клиент);
		П.Вставить("Пользователь", Пользователь);
		П.Вставить("ВП", ВП);
		П.Вставить("ЛокальныйАдрес", ЛокальныйАдрес);
		ОткрытьФорму("Справочник.ТЦВП.Форма.УправляемоеВРМ", П,,, ОсновноеОкно());
	#КонецЕсли
	
	#Если Не ТонкийКлиент И Не ВебКлиент Тогда
		ТЦСервер.УстановитьТипКлиентскогоПриложения(ПараметрыСеанса.ТЦТипКлиентскогоПриложения);
	#КонецЕсли
	
КонецПроцедуры // ВключитьРежимВРМ()

// Открыть форму результатов теста
//
// Параметры:
//  Тест - ДокументСсылка.ТЦТест, открываемый документ
//
Процедура ПоказатьРезультатыТеста(Тест) Экспорт
	
	П = Новый Структура;
	П.Вставить("Ключ", Тест);
	ОткрытьФорму("Документ.ТЦТест.Форма.ОсновнойОтчет", П,,, ОсновноеОкно());
	
КонецПроцедуры // ПоказатьРезультатыТеста()

// Открыть форму результатов теста
//
// Параметры:
//  Тест - ДокументСсылка.ТЦТест, открываемый документ
//
Процедура ПоказатьСписокАгентов() Экспорт
	
	ОткрытьФорму("Справочник.ТЦАгенты.Форма.Агенты",,,, ОсновноеОкно());
	
КонецПроцедуры // ПоказатьСписокАгентов()

// Открыть форму, отображающую состояние тестирования
//
Процедура ПоказатьСостояниеТестирования() Экспорт
	
	ОткрытьФорму("ОбщаяФорма.ТЦСостояниеВыполненияТеста",,,, ОсновноеОкно());
	
КонецПроцедуры // ПоказатьСостояниеТестирования()

// Получить форму, отображающую состояние тестирования
//
Функция ПолучитьФормуСостояниеТестирования() Экспорт
	
	Форма = ПолучитьФорму("ОбщаяФорма.ТЦСостояниеВыполненияТеста",,,, ОсновноеОкно());
	
	Возврат Форма;
	
КонецФункции // ПоказатьСостояниеТестирования()

// Выполнить действие в соответствии с параметром запуска (/C)
// TCA (Test-center Agent) - запуск в режиме агента
// TCVW (Test-center Virtual Workplace) - запуск в режиме ВРМ
//
// Параметры:
//  Параметры - Строка, параметры командной строки
//
Процедура ОбработатьПараметрЗапуска(Параметры) Экспорт
	
	Если ПустаяСтрока(Параметры) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВРег = ВРег(Параметры);
	ПараметрыМассив = ТЦОбщий.РазделитьСтроку(ПараметрыВРег, ";");
	
	Если ПараметрыМассив[0] = "TCA" Тогда
		ВключитьРежимАгента();
	ИначеЕсли ПараметрыМассив[0] = "TCVW" Тогда
		Клиент = ТЦСервер.СсылкаПоИдентификатору(
			ПараметрыМассив[1],
			"Справочники",
			"ТЦКлиенты");
		Пользователь = ТЦСервер.СсылкаПоИдентификатору(
			ПараметрыМассив[2],
			"Справочники",
			"ТЦПользователи");
		ВП = ТЦСервер.СсылкаПоИдентификатору(
			ПараметрыМассив[3],
			"Справочники",
			"ТЦВП");
		ЛокальныйАдрес = ПараметрыМассив[4];
		ВключитьРежимВРМ(Клиент, ТЦСервер.НайтиОригиналПоКлону(Пользователь), ВП, ЛокальныйАдрес);
	КонецЕсли;
	
КонецПроцедуры // ОбработатьПараметрЗапуска()


///////////////////////////////////////////////////////////////////////////////
// СООБЩЕНИЯ

// Получить адрес подключения для информационной базы
//
// Возвращаемое значение:
//  Строка - имя подключения
//
Функция АдресЛокальногоПодключения() Экспорт
	
	Соединение = СтрокаСоединенияИнформационнойБазы(); // ТЦСервер.СтрокаСоединенияИнформационнойБазыНаСервере();
	Параметры = ТЦОбщий.ПолучитьПараметрыПодключения(Соединение);
	Если Параметры.Свойство("ИмяСервера") Тогда
		Имя = Параметры.ИмяСервера + "_"
		    + Формат(Параметры.ПортКластера, "ЧГ=0") + "_"
		    + ТЦОбщий.УдалитьКавычки(Параметры.Ref);
	Иначе
		Имя = ТЦОбщий.УдалитьКавычки(Параметры.ws);
	КонецЕсли;
	Возврат ВРег(Имя);
	
КонецФункции // АдресЛокальногоПодключения()

// Получить адрес агента на текущем компьютере
//
// Параметры:
//  АдресЛокальногоПодключения - Строка, см. АдресЛокальногоПодключения()
//
// Возвращаемое значение:
//  Строка - уникальное имя агента на этом компьютере
//
Функция ЛокальныйАдресАгента(АдресЛокальногоПодключения) Экспорт
	
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	НомерСессии = Формат(КипВнешнийКомпонент.НомерСессии(Инструменты), "ЧН=0; ЧГ=0");
	Возврат "AGENT_" + НомерСессии + "_" + АдресЛокальногоПодключения + "_" + ВРег(ИмяКомпьютера);
	
КонецФункции // ЛокальныйАдресАгента()

// Получить адрес ВРМ на текущем компьютере
//
// Параметры:
//  АдресЛокальногоПодключения - Строка, см. АдресЛокальногоПодключения()
//  Ссылка - СправочникСсылка.ТЦВРМ, ссылка на ВРМ
//
// Возвращаемое значение:
//  Строка - уникальное имя агента на этом компьютере
//
Функция ЛокальныйАдресВРМ(АдресЛокальногоПодключения, Ссылка) Экспорт
	
	Адрес = ТЦСервер.СсылкуВСтроку(Ссылка);
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	НомерСессии = Формат(КипВнешнийКомпонент.НомерСессии(Инструменты), "ЧН=0; ЧГ=0");
	Возврат "VW_" + НомерСессии + "_" + АдресЛокальногоПодключения + "_" + Адрес;
	
КонецФункции // ЛокальныйАдресВРМ()

// Создать параметры запуска ВРМ
//
// Возвращаемое значение:
//  Структура:
//    Пользователь - Строка, имя пользователя
//    Пароль - Строка, пароль пользователя
//    Количество - Число, количество таких пользователей
//
Функция ПараметрыЗапускаВРМ() Экспорт
	
	Возврат Новый Структура("Пользователь, Пароль, Количество");
	
КонецФункции // ПараметрыЗапускаВРМ()

&НаКлиенте
// Подключить механизм локальных сообщений
//
// Параметры:
//  Сообщения - Объект работы с локальными сообщениями
//  Адрес - Строка, адрес по которому принимаются сообщения
//
Функция ПодключитьЛокальныеСообщения(Сообщения, Порт = 0) Экспорт
	
	ПортСервераСообщений = 0;
	Если Сообщения = Неопределено Тогда
		Сообщения = КипВнешнийКомпонент.ПолучитьОбработчикСообщений();
		ПортСервераСообщений = КипВнешнийКомпонент.ПодключитьСообщения(Сообщения, Порт);
	КонецЕсли;
	
	Возврат ПортСервераСообщений;
	
КонецФункции // ПодключитьЛокальныеСообщения()

&НаКлиенте
// Отключить механизм локальных сообщений
//
// Параметры:
//  Сообщения - Объект работы с локальными сообщениями
//
Процедура ОтключитьЛокальныеСообщения(Сообщения) Экспорт
	
	Если Сообщения <> Неопределено Тогда
		КипВнешнийКомпонент.ОтключитьСообщения(Сообщения);
		Сообщения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ОтключитьЛокальныеСообщения()


///////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС ПОЛЬЗОВАТЕЛЯ

// Получить основное окно приложения
//
// Возвращаемое значение:
//  ОкноКлиентскогоПриложения - основное окно
//
Функция ОсновноеОкно() Экспорт
	
	Окна = ПолучитьОкна();
	
	Если Окна = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для каждого Окно Из Окна Цикл
		Если Окно.Основное Тогда
			Возврат Окно;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ОсновноеОкно()

// Отобразить информацию об ошибке в специализированном диалоговом окне
//
// Параметры:
//  ИнформацияОбОшибке - ИнформацияОбОшибке
//
Процедура СообщитьОбОшибке(Ошибка, ДатаНачала, ДатаОкончания) Экспорт
	
	Параметры = Новый Структура;
	
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		Параметры.Вставить("Ошибка", ТЦОбщий.ИнформациюОбОшибкеВСтруктуру(Ошибка));
	Иначе
		Параметры.Вставить("Ошибка", Ошибка);
	КонецЕсли;
	
	Параметры.Вставить("ДатаНачала", ДатаНачала);
	Параметры.Вставить("ДатаОкончания", ДатаОкончания);
	ОткрытьФорму("ОбщаяФорма.ТЦОшибка", Параметры);
	
КонецПроцедуры // СообщитьОбОшибке()

// Получить имя формы тестовой обработки
//
// Параметры:
//  ТестоваяОбработка - СправочникСсылка.ТЦОбработки
//
// Возвращаемое значение:
//  Строка - строка с именем формы тестовой обработки
//
Функция ПолучитьИмяФормыОбработки(ТестоваяОбработка) Экспорт
	
	ТипВнешняя = ПредопределенноеЗначение("Перечисление.ТЦТипОбработки.Внешняя");
	ТипВнутренняя = ПредопределенноеЗначение("Перечисление.ТЦТипОбработки.Внутренняя");
	Реквизиты = ТЦСервер.РеквизитыОбъектаПоСсылке(ТестоваяОбработка);
	ИмяФормы = ".Форма.ТЦФорма";
	
	Если Реквизиты.Тип = ТипВнешняя Тогда
		Путь = ПолучитьНавигационнуюСсылку(ТестоваяОбработка, "Файл");
		ИмяОбработки = ТЦСервер.ПодключитьОбработку(Путь);
		ИмяФормы = "ВнешняяОбработка." + ИмяОбработки + ИмяФормы;
	ИначеЕсли Реквизиты.Тип = ТипВнутренняя Тогда
		ИмяФормы = "Обработка." + Реквизиты.ИмяОбработки + ИмяФормы;
	КонецЕсли;
	
	Возврат ИмяФормы;
	
КонецФункции // ПолучитьИмяФормыОбработки()

// Задать вопрос о необходимости закрытия формы состояния выполнения теста
//
// Возвращаемое значение:
//  Булево - Истина, закрыть окно, Ложь, не закрывать
//
Функция ЗакрытьОкноСостоянияВыполненияТеста() Экспорт
	
	Текст =  НСтр("ru = 'Закрытие окна состояния выполнения теста не завершит выполнение 
						|процесса тестирования, который будет продолжаться на стороне 
						|сервера в отдельном фоновом задании. Если тестирование все еще 
						|будет выполняться во время повторного открытия окна состояния 
						|выполнения теста, то будет отображен текущий процесс тестирования.
						|
						|Продолжить?'")	;
	РезультатВопроса = Вопрос(
		Текст,
		РежимДиалогаВопрос.ДаНет,,
		КодВозвратаДиалога.Нет,
		"Тест-центр");
		
	Возврат РезультатВопроса = КодВозвратаДиалога.Да;
	
КонецФункции // ЗакрытьОкноСостоянияВыполненияТеста()


///////////////////////////////////////////////////////////////////////////////
// КЛИЕНТЫ

// Запустить клиента от имени указанного пользователя
//
// Параметры:
//  Клиент - СправочникСсылка.ТЦКлиент
//  Пользователь - СправочникСсылка.ТЦПользователь
//  Ид - Строка, уникальный идентификатор нового ВРМ
//
Процедура ЗапуститьКлиента(Клиент, Пользователь, Ид) Экспорт
	
	ПараметрыПользователя = ТЦСервер.ПараметрыПользователя(Пользователь);
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	
	СисИнфо = Новый СистемнаяИнформация;
	ЭтоLinux = СисИнфо.ТипПлатформы = ТипПлатформы.Linux_x86
	       Или СисИнфо.ТипПлатформы = ТипПлатформы.Linux_x86_64;
		   
	АдресЛокальногоПодключения = ТЦКлиент.АдресЛокальногоПодключения();
	Если ПараметрыПользователя.ТипАутентификации = ПредопределенноеЗначение("Перечисление.ТЦТипАутентификации.АутентификацияОС") Тогда
		КипВнешнийКомпонент.ЗапуститьПрограмму(
			Инструменты,
			ТЦСервер.ПолнаяСтрокаЗапуска(Клиент, Пользователь, Ид, АдресЛокальногоПодключения, ЭтоLinux),
			ПараметрыПользователя.Имя,
			ПараметрыПользователя.Домен,
			ПараметрыПользователя.Пароль);
	Иначе
		КипВнешнийКомпонент.ЗапуститьПрограмму(
			Инструменты,
			ТЦСервер.ПолнаяСтрокаЗапуска(Клиент, Пользователь, Ид, АдресЛокальногоПодключения, ЭтоLinux));
	КонецЕсли;
	
КонецПроцедуры // ЗапуститьКлиента()


///////////////////////////////////////////////////////////////////////////////
// ВИРТУАЛЬНОЕ РАБОЧЕЕ МЕСТО

// Создать контекст выполнения ВРМ
//
// Возвращаемое значение:
//  Структура
//    Адрес - Строка, адрес на который ВРМ принимает локальные сообщения
//    Номер - Число, порядковый номер ВРМ относительно теста
//    Сообщения - ВнешнийКомпонент, рассылка и прием локальных сообщений
//    Сценарий - СправочникСсылка.ТЦСценарии
//    ФормаОбработки - УправляемаяФорма, форма тестовой обработки
//
Функция СоздатьКонтекстВРМ(Клиент, Пользователь, ВРМ, ЛокальныйАдрес, ФормаВРМ) Экспорт
	
	Перем Сообщения;
	
	Контекст = Новый Структура("Адрес, Порт, Компьютер, ВРМ, Клиент, Номер, Перечисления, ЛокальныйАдрес, НомерСеанса, Пользователь, Клон, Сообщения, Сценарий, ФормаОбработки, ФормаВРМ, ПродолжатьРаботуМеждуИтерациями, ИдетПовторноеВыполнение, КоэффициентИнтенсивности");
	ПараметрыДляВРМ = ТЦСервер.ПолучитьПараметрыДляВРМ();
	
	Контекст.ВРМ = ВРМ;
	Контекст.Клиент = Клиент;
	Контекст.Пользователь = Пользователь;
	Контекст.НомерСеанса = ПараметрыДляВРМ.НомерСеанса;
	Контекст.Перечисления = ПараметрыДляВРМ.Перечисления;
	Контекст.ФормаВРМ = ФормаВРМ;
	Контекст.ИдетПовторноеВыполнение = Ложь;
	Контекст.КоэффициентИнтенсивности = 1;
	
	Контекст.ЛокальныйАдрес = ЛокальныйАдрес;
	Контекст.Адрес = ТЦКлиент.ЛокальныйАдресВРМ(ЛокальныйАдрес, ВРМ);
	
	ФактическийПорт = ТЦКлиент.ПодключитьЛокальныеСообщения(Сообщения);
	Контекст.Порт = ФактическийПорт;
	Контекст.Сообщения = Сообщения;
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	НомерСессии = КипВнешнийКомпонент.НомерСессии(Инструменты);
	НомерПроцесса = КипВнешнийКомпонент.НомерПроцесса(Инструменты);
	ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);

	Клон = ПараметрыДляВРМ.Клон;
	Контекст.Клон = Строка(Клон);
	Контекст.Компьютер = ИмяКомпьютера;
	ТЦСервер.СоздатьВРМ(ТЦКлиент.ПолучитьИмяВРМ(Пользователь, Строка(Клон),,Контекст.НомерСеанса), Клиент, ИмяКомпьютера, НомерСессии, Пользователь, Клон, ФактическийПорт, ВРМ);
	УстановитьЗаголовокПриложения("ВРМ");	
	
	ТЦКлиент.ОтправитьАгенту(
		Контекст,
		Контекст.Перечисления.ТЦСообщение.ГотовКРаботе,
		ТЦКлиент.ПараметрыОтветаВРМ(ВРМ));
	
	Возврат Контекст;
	
КонецФункции // СоздатьКонтекстВРМ()

// Удалить контекст выполнения ВРМ
//
// Параметры:
//  Контекст - Структура (см. СоздатьКонтекстВРМ())
//
Процедура УдалитьКонтекстВРМ(Контекст) Экспорт
	
	ТЦКлиент.ОтключитьЛокальныеСообщения(Контекст.Сообщения);
	ТЦСервер.УдалитьВРМ(Контекст.ВРМ);
	
КонецПроцедуры // УдалитьКонтекстВРМ()

// Создать параметры ответа ВРМ
//
// Параметры:
//  СсылкаВРМ - СправочникСсылка.ТЦВП
//
// Возвращаемое значение:
//  Структура
//    ВРМ - СправочникСсылка.ТЦВП
//    Результат - Произвольный
//    РезультатВыполнения - ПеречислениеСсылка.ТЦРезультатВыполнения
//	  Состояние - ПеречислениеСсылка.ТЦСостояние
//
Функция ПараметрыОтветаВРМ(СсылкаВРМ) Экспорт
	
	ПараметрыОтвета= Новый Структура;
	ПараметрыОтвета.Вставить("ВРМ", СсылкаВРМ);
	ПараметрыОтвета.Вставить("Результат");
	ПараметрыОтвета.Вставить("РезультатВыполнения");
	ПараметрыОтвета.Вставить("Состояние");
	
	Возврат ПараметрыОтвета;
	
КонецФункции // ПараметрыОтветаВРМ()// Создать параметры ответа ВРМ

// Создать параметры сообщения агента об ошибке
// Параметры:
//    Состояние - ПеречислениеСсылка.ТЦСостояние
//
// Возвращаемое значение:
//  Структура:
//    Результат - Произвольный
//	  Состояние - ПеречислениеСсылка.ТЦСостояние
//	  ВесОшибки - Число, соответствует количеству ВРМ, которые вызвали ошибку
//
Функция ПараметрыСообщенияАгентаОбОшибке(Состояние) Экспорт
	
	ПараметрыСообщения= Новый Структура;
	ПараметрыСообщения.Вставить("Результат");
	ПараметрыСообщения.Вставить("Состояние", Состояние);
	ПараметрыСообщения.Вставить("ВесОшибки");
	
	Возврат ПараметрыСообщения;
	
КонецФункции // ПараметрыОтветаВРМ()

// Отправить локальное сообщение Агенту от ВРМ
//
// Параметры:
//  Контекст - Структура (см. СоздатьКонтекстВРМ())
//  Сообщение - ПеречислениеСсылка.ТЦСообщение
//  Параметры - Произвольный
//
Процедура ОтправитьАгенту(Контекст, Сообщение, Параметры = Неопределено) Экспорт
	
	Пакет = ТЦСервер.ЗапаковатьЛокальноеСообщение(Контекст.Адрес, Сообщение, Параметры);
	ЛокальныйАдрес = Контекст.ЛокальныйАдрес;
	АдресАгента = ТЦКлиент.ЛокальныйАдресАгента(ЛокальныйАдрес);
	ПортАгента = ТЦКлиент.ЛокальныйПортАгента();

	Попытка 
		КипВнешнийКомпонент.ОтправитьСообщение(Контекст.Сообщения, АдресАгента, ПортАгента, Пакет);
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ОписаниеОшибки(), "ИсключениеПриОтправкеОтВРМ");
	КонецПопытки;
	
КонецПроцедуры // ОтправитьЛокальноеСообщениеАгенту()

// Получить наименование ВРМ
//
// Параметры:
//  НомерВРМ - Число, порядковый номер ВРМ
//
// Возвращаемое значение:
//  Строка - наименование ВРМ
//
Функция ПолучитьИмяВРМ(Пользователь, ИмяКлона, Знач НомерВРМ = Неопределено, Знач НомерСеанса = Неопределено) Экспорт
	
	Инструменты		= КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяКомпьютера	= КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	НомерСессии		= КипВнешнийКомпонент.НомерСессии(Инструменты);
	НомерПроцесса	= КипВнешнийКомпонент.НомерПроцесса(Инструменты);
	ИмяПользователя = ТЦСервер.ИмяПользователяИБ(Пользователь);
	Номер = ?(НомерВРМ = Неопределено, "", "; ВРМ №" + Формат(НомерВРМ, "ЧГ=0"));
	НомерСеанса = ?(НомерСеанса = Неопределено, "", ", сеанс: "  + Формат(НомерСеанса, "ЧГ=0"));
	
	Возврат ИмяКомпьютера + "." + НомерСессии + " (PID: " + Формат(НомерПроцесса, "ЧГ=0") + НомерСеанса +  "); " + ИмяКлона + Номер;
	
КонецФункции // ПолучитьИмяВРМ()

// Обработать сообщение, которое пришло от Агента
//
// Параметры:
//  Контекст - структура, контекст выполнения
//  Данные - Строка, данные, которые пришли от ВРМ
//
Функция ОбработатьСообщениеВРМ(Контекст, Данные) Экспорт
	
	ОбновитьВРМ = Ложь;
	Состояние = Неопределено; // Состояние, переданное в сообщении от агента
	
	Попытка
		ОтветноеСообщение = Неопределено;
		ПараметрыОтвета = ТЦКлиент.ПараметрыОтветаВРМ(Контекст.ВРМ);
		Пакет = ТЦСервер.РаспаковатьЛокальноеСообщение(Данные);
		Сообщение = Пакет.Сообщение;
		Отправитель = Пакет.Отправитель;
		
		Если Сообщение = Контекст.Перечисления.ТЦСообщение.ПроверкаАктивности Тогда
			ОтветноеСообщение = Контекст.Перечисления.ТЦСообщение.ГотовКРаботе;
		ИначеЕсли Сообщение = Контекст.Перечисления.ТЦСообщение.Выполнить Тогда
			
			Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
			КипВнешнийКомпонент.НачатьВыполнение(Инструменты);
			Состояние = Пакет.Параметры.Состояние;
			ОтветноеСообщение = Контекст.Перечисления.ТЦСообщение.ВыполненоУспешно;
			
			Если Состояние = Контекст.Перечисления.ТЦСостояние.Подготовка Тогда
				
				Если Не Контекст.ИдетПовторноеВыполнение Тогда
					Контекст.ФормаВРМ.ВозниклоИсключение = Ложь;
					Контекст.ФормаВРМ.ТекстОшибкиОбработки = "";
					ТЦСервер.УстановитьСтатусВыполненияТеста(Истина);
					Контекст.Номер = Пакет.Параметры.Параметры.НомерВРМ;
					Контекст.КоэффициентИнтенсивности = Пакет.Параметры.Параметры.КоэффициентИнтенсивности;
					ИмяВРМ = ТЦКлиент.ПолучитьИмяВРМ(Контекст.Пользователь, Контекст.Клон, Контекст.Номер, Контекст.НомерСеанса);
					ТЦСервер.ИзменитьИмяВРМ(ИмяВРМ, Контекст.Номер, Контекст.ВРМ);
					Контекст.Сценарий = Пакет.Параметры.Параметры.Сценарий;
					ЗагрузитьВРМ(Контекст);
				КонецЕсли;
				
				ОбновитьВРМ = Истина;
				ПараметрыОтвета.РезультатВыполнения = Контекст.Перечисления.ТЦРезультатВыполнения.Успешно;
				ПараметрыОтвета.Состояние = Контекст.Перечисления.ТЦСостояние.Подготовка;
				
			ИначеЕсли Состояние = Контекст.Перечисления.ТЦСостояние.Инициализация Тогда
				
				Если Не Контекст.ИдетПовторноеВыполнение Тогда
					Контекст.ФормаВРМ.РезультатВыполнения = Контекст.Перечисления.ТЦРезультатВыполнения.Неопределено;
					Контекст.ФормаВРМ.ВозниклоИсключение = Ложь;
					Контекст.ФормаВРМ.ТекстОшибкиОбработки = "";
					ОтветноеСообщение = ВыполнитьМетодОбработки(
						Контекст,
						"ТЦИнициализировать",
						ПараметрыОтвета,
						"Ошибка инициализации");
					Контекст.ФормаВРМ.РезультатВыполнения = ПараметрыОтвета.РезультатВыполнения;
				Иначе
					ПараметрыОтвета.РезультатВыполнения = Контекст.Перечисления.ТЦРезультатВыполнения.Успешно;
				КонецЕсли;
				
				ПараметрыОтвета.Состояние = Контекст.Перечисления.ТЦСостояние.Инициализация;
				
			ИначеЕсли Состояние = Контекст.Перечисления.ТЦСостояние.Выполнение Тогда
				
				Если Не Контекст.ИдетПовторноеВыполнение Тогда
					ТЦСервер.УстановитьСостояниеВРМ(Контекст.ВРМ, Контекст.Перечисления.ТЦСостояние.Выполнение);
					Контекст.ФормаВРМ.РезультатВыполнения = Контекст.Перечисления.ТЦРезультатВыполнения.Неопределено;
					Контекст.ФормаВРМ.ВозниклоИсключение = Ложь;
					Контекст.ФормаВРМ.ТекстОшибкиОбработки = "";
					ОтветноеСообщение = ВыполнитьМетодОбработки(
						Контекст,
						"ТЦВыполнить",
						ПараметрыОтвета,
						"Ошибка выполнения действия пользователя");
					Контекст.ФормаВРМ.РезультатВыполнения = ПараметрыОтвета.РезультатВыполнения;
					ПараметрыОтвета.Состояние = Контекст.Перечисления.ТЦСостояние.Выполнение;
					
					ТЦКлиент.ЗаписатьРезультатыОценкиПроизводительности();
				КонецЕсли;

			ИначеЕсли Состояние = Контекст.Перечисления.ТЦСостояние.ЗаписьРезультатов Тогда
				
				ТЦСервер.УстановитьСостояниеВРМ(Контекст.ВРМ, Контекст.Перечисления.ТЦСостояние.ЗаписьРезультатов);
				Если Контекст.ИдетПовторноеВыполнение Тогда
					Контекст.ФормаВРМ.ОтключитьОбработчикОжидания("ОжидатьЗавершениеВыполнения");
					
					Попытка
						Контекст.ФормаОбработки.ОтключитьОбработчикОжидания("ТЦОбработчикВыполнения");
					Исключение
						ТЦОбщий.ЗаписатьВЖурнал(ОписаниеОшибки(), "ВРМ", Контекст.Перечисления.ТЦСтатусСообщения.Предупреждение);
					КонецПопытки;
					
					Контекст.ИдетПовторноеВыполнение = Ложь;
				КонецЕсли;
				ПараметрыОтвета.Результат = Контекст.ФормаОбработки.ТЦПолучитьРезультат();
				ПараметрыОтвета.РезультатВыполнения = Контекст.Перечисления.ТЦРезультатВыполнения.Успешно;
				ПараметрыОтвета.Состояние = Контекст.Перечисления.ТЦСостояние.ЗаписьРезультатов;
				
			ИначеЕсли Состояние = Контекст.Перечисления.ТЦСостояние.УдалениеДанных Тогда
				
				ТЦСервер.УстановитьСостояниеВРМ(Контекст.ВРМ, Контекст.Перечисления.ТЦСостояние.УдалениеДанных);
				Контекст.ФормаВРМ.РезультатВыполнения = Контекст.Перечисления.ТЦРезультатВыполнения.Неопределено;
				Контекст.ФормаВРМ.ВозниклоИсключение = Ложь;
				Контекст.ФормаВРМ.ТекстОшибкиОбработки = "";
				ОтветноеСообщение = ВыполнитьМетодОбработки(
					Контекст,
					"ТЦУдалитьДанные",
					ПараметрыОтвета,
					"Ошибка удаления данных");
				Контекст.ФормаВРМ.РезультатВыполнения = ПараметрыОтвета.РезультатВыполнения;
				ПараметрыОтвета.Состояние = Контекст.Перечисления.ТЦСостояние.УдалениеДанных;				
				ТЦСервер.УстановитьСостояниеВРМ(Контекст.ВРМ, Контекст.Перечисления.ТЦСостояние.Неактивен);
				ТЦСервер.УстановитьСтатусВыполненияТеста(Ложь);
			КонецЕсли;
			
			Если ПараметрыОтвета.РезультатВыполнения = Контекст.Перечисления.ТЦРезультатВыполнения.Ошибка Тогда
				ОтветноеСообщение = Контекст.Перечисления.ТЦСообщение.ВыполненоСОшибкой;
			КонецЕсли;
		ИначеЕсли Сообщение = Контекст.Перечисления.ТЦСообщение.ЗавершитьРаботу Тогда
			ТЦСервер.УстановитьСтатусВыполненияТеста(Ложь);
			ТЦКлиент.УдалитьКонтекстВРМ(Контекст);
			ЗавершитьРаботуСистемы(Ложь);
			Возврат Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтветноеСообщение) Тогда
			Если ПараметрыОтвета.РезультатВыполнения = Контекст.Перечисления.ТЦРезультатВыполнения.Продолжить Тогда
				
				ИнтервалОжидания = 1;
				#Если ВебКлиент Тогда
					ИнтервалОжидания = 10;
				#КонецЕсли
				Контекст.ФормаВРМ.ПодключитьОбработчикОжидания("ОжидатьЗавершениеВыполнения", ИнтервалОжидания);
				
			Иначе
				ТЦКлиент.ОтправитьАгенту(Контекст, ОтветноеСообщение, ПараметрыОтвета);
			КонецЕсли;
		КонецЕсли;
	Исключение
		
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "ВРМ");
		
		Если Контекст.Сообщения <> Неопределено Тогда
			ПараметрыОтветаВРМ = ТЦКлиент.ПараметрыОтветаВРМ(Контекст.ВРМ);
			ПараметрыОтветаВРМ.Результат = "ВРМ не смог обработать сообщение Агента (клон: " + Контекст.Клон + ", компьютер: " + Контекст.Компьютер +  "):";
			
			Если Контекст.ИдетПовторноеВыполнение Тогда
				ПараметрыОтветаВРМ.Результат = ПараметрыОтветаВРМ.Результат + Символы.ПС + "Ошибка произошла во время повторения этапа ""Выполнение""";
				Контекст.ФормаВРМ.ОтключитьОбработчикОжидания("ОжидатьЗавершениеВыполнения");
				
				Попытка
					Контекст.ФормаОбработки.ОтключитьОбработчикОжидания("ТЦОбработчикВыполнения");
				Исключение
					ТЦОбщий.ЗаписатьВЖурнал(ОписаниеОшибки(), "ВРМ", Контекст.Перечисления.ТЦСтатусСообщения.Предупреждение);
				КонецПопытки;
				
				Контекст.ИдетПовторноеВыполнение = Ложь;
			ИначеЕсли Состояние <> Неопределено Тогда
				ПараметрыОтветаВРМ.Результат = ПараметрыОтветаВРМ.Результат + Символы.ПС + "Ошибка произошла во время этапа """ + Строка(Состояние) +  """";
			КонецЕсли;
			
			ПараметрыОтветаВРМ.Результат = ПараметрыОтветаВРМ.Результат + Символы.ПС + "Подробности: " + Символы.ПС + ТЦОбщий.ИнформациюОбОшибкеВСтроку(ИнформацияОбОшибке());
			
			ТЦКлиент.ОтправитьАгенту(
				Контекст,
				Контекст.Перечисления.ТЦСообщение.ВыполненоСОшибкой,
				ПараметрыОтветаВРМ);
			ТЦСервер.УстановитьСтатусВыполненияТеста(Ложь);
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат ОбновитьВРМ;
	
КонецФункции // ОбработатьСообщениеВРМ()

// Обработать ожидание завершения действия ВРМ
//
// Параметры:
//  Контекст - Структура, контекст выполнения
//  Форма - Форма, содержащая обработчик и дополнительные параметры
//
Функция ОбработатьОжиданиеВРМ(Контекст, Форма) Экспорт
	
	Попытка
		Продолжение = Контекст.Перечисления.ТЦРезультатВыполнения.Продолжить;
		Успешно = Контекст.Перечисления.ТЦСообщение.ВыполненоУспешно;
		Ошибка = Контекст.Перечисления.ТЦСообщение.ВыполненоСОшибкой;
		
		Если Форма.ВозниклоИсключение Или Форма.РезультатВыполнения <> Продолжение Тогда
			Контекст.ФормаВРМ.ОтключитьОбработчикОжидания("ОжидатьЗавершениеВыполнения");
			ПараметрыОтвета = ТЦКлиент.ПараметрыОтветаВРМ(Контекст.ВРМ);
			ПараметрыОтвета.РезультатВыполнения = Форма.РезультатВыполнения;
			ПараметрыОтвета.Результат = Контекст.ФормаОбработки.ТЦПолучитьРезультат();
			ПараметрыОтвета.Состояние = Контекст.Перечисления.ТЦСостояние.Выполнение;
			
			Если Форма.ВозниклоИсключение Тогда
				ПараметрыОтвета.Результат = "При выполнении тестовой обработки возникли ошибки (клон: " + Контекст.Клон + ", компьютер: " + Контекст.Компьютер +  ")"
											+ Символы.ПС + Форма.ТекстОшибкиОбработки;
				ТЦКлиент.ОтправитьАгенту(Контекст, Ошибка, ПараметрыОтвета);
			Иначе
				ТЦКлиент.ЗаписатьРезультатыОценкиПроизводительности();
				
				ПараметрыОтвета.Состояние = Контекст.Перечисления.ТЦСостояние.Выполнение;
				ТЦКлиент.ОтправитьАгенту(Контекст, Успешно, ПараметрыОтвета);
				
				// Если выполняется динамический тест, то следует продолжить выполнение
				Если Контекст.ПродолжатьРаботуМеждуИтерациями Тогда
					Контекст.ИдетПовторноеВыполнение = Истина;
					
					ОтветноеСообщение = ВыполнитьМетодОбработки(
						Контекст,
						"ТЦВыполнить",
						ПараметрыОтвета,
						"Ошибка выполнения действия пользователя");
					Контекст.ФормаВРМ.РезультатВыполнения = ПараметрыОтвета.РезультатВыполнения;
					ПараметрыОтвета.Состояние = Контекст.Перечисления.ТЦСостояние.Выполнение;
					
					Если ЗначениеЗаполнено(ОтветноеСообщение) Тогда
						Если ПараметрыОтвета.РезультатВыполнения = Контекст.Перечисления.ТЦРезультатВыполнения.Продолжить Тогда
							
							ИнтервалОжидания = 1;
							#Если ВебКлиент Тогда
								ИнтервалОжидания = 10;
							#КонецЕсли
							Контекст.ФормаВРМ.ПодключитьОбработчикОжидания("ОжидатьЗавершениеВыполнения", ИнтервалОжидания);
							
						Иначе
							ТЦКлиент.ОтправитьАгенту(Контекст, ОтветноеСообщение, ПараметрыОтвета);
						КонецЕсли;
					КонецЕсли;										
					
				КонецЕсли;
			КонецЕсли;
			
			Возврат Истина;
		КонецЕсли;
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "ВРМ");
		Если Контекст.Сообщения <> Неопределено Тогда
			ПараметрыОтветаВРМ = ТЦКлиент.ПараметрыОтветаВРМ(Контекст.ВРМ);
			ПараметрыОтветаВРМ.Результат = "Ошибка в обработчике ожидания завершения работы виртуального пользователя" 
										   +" (клон: " +	Контекст.Клон + ", компьютер: " + Контекст.Компьютер +  "): " + Символы.ПС 
										   +ТЦОбщий.ИнформациюОбОшибкеВСтроку(ИнформацияОбОшибке());
			ТЦКлиент.ОтправитьАгенту(
				Контекст,
				Контекст.Перечисления.ТЦСообщение.ВыполненоСОшибкой,
				ПараметрыОтветаВРМ);
		КонецЕсли;
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции // ОбработатьОжиданиеВРМ()

// Выполнить метод внешней обработки
//
// Параметры:
//  Контекст - Структура, контекст выполнения
//  Метод - Строка, имя выполняемого метода
//
// Возвращаемое значение:
//  Перечисление.ТЦРезультатВыполнения
//
Функция ВыполнитьМетодОбработки(Контекст, Метод, ПараметрыОтвета, Ошибка)
	
	Попытка
		ПараметрыОтвета.РезультатВыполнения = Вычислить("Контекст.ФормаОбработки." + Метод + "()");
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "ВРМ");
		ПараметрыОтвета.Результат = Ошибка + " (клон: " + Контекст.Клон + ", компьютер: " + Контекст.Компьютер +  "):" + Символы.ПС + ОписаниеОшибки();
		Если Метод = "ТЦИнициализировать" Тогда
			ПараметрыОтвета.Состояние = Контекст.Перечисления.ТЦСостояние.Инициализация;
		ИначеЕсли Метод = "ТЦВыполнить" Тогда
			ПараметрыОтвета.Состояние = Контекст.Перечисления.ТЦСостояние.Выполнение;
		ИначеЕсли Метод = "ТЦУдалитьДанные" Тогда
			ПараметрыОтвета.Состояние = Контекст.Перечисления.ТЦСостояние.УдалениеДанных;
		КонецЕсли;
		
		Возврат Контекст.Перечисления.ТЦСообщение.ВыполненоСОшибкой;
	КонецПопытки;
	
	Если ПараметрыОтвета.РезультатВыполнения = Контекст.Перечисления.ТЦРезультатВыполнения.Ошибка Тогда
		ПараметрыОтвета.Результат = Ошибка;
		Возврат Контекст.Перечисления.ТЦСообщение.ВыполненоСОшибкой;
	КонецЕсли;
	
	Возврат Контекст.Перечисления.ТЦСообщение.ВыполненоУспешно;
	
КонецФункции // ВыполнитьМетодОбработки()

// Загрузить ВРМ
//
Процедура ЗагрузитьВРМ(Контекст)
	
	ТЦОбщий.ЗаписатьВЖурнал("ПолучитьПараметрыЗагрузкиВРМ", "ВРМ");
	ТЦОбщий.ЗаписатьВЖурнал(Контекст.ВРМ.УникальныйИдентификатор(), "ВРМ");
	Параметры = ТЦСервер.ПолучитьПараметрыЗагрузкиВРМ(Контекст.ВРМ);
	Контекст.ПродолжатьРаботуМеждуИтерациями = Параметры.ПродолжатьРаботуМеждуИтерациями;
	
	ТЦОбщий.ЗаписатьВЖурнал("ПолучитьИмяФормыОбработки", "ВРМ");
	ИмяФормыОбработки = ТЦКлиент.ПолучитьИмяФормыОбработки(Параметры.Обработка);
	
	ТЦОбщий.ЗаписатьВЖурнал("ТЦЗагрузить", "ВРМ");
	Контекст.ФормаОбработки = ПолучитьФорму(ИмяФормыОбработки);
	
	ТЦОбщий.ЗаписатьВЖурнал("ТЦЗагрузить", "ВРМ");
	Контекст.ФормаОбработки.ТЦЗагрузить(Параметры.ПараметрыОбработки);

	КонтекстВРМ = Контекст.ФормаОбработки.ТЦКонтекст();
	КонтекстВРМ.ФормаВРМ = Контекст.ФормаВРМ;
	КонтекстВРМ.КоэффициентИнтенсивности = Контекст.КоэффициентИнтенсивности;
	ВРМ = КонтекстВРМ.ВРМ;
	ВРМ.Номер = Контекст.Номер;
	ВРМ.Сценарий = Контекст.Сценарий;
	ВРМ.Роль = Параметры.Роль;
	ВРМ.ИмяРоли = Параметры.ИмяРоли;
	ВРМ.Компьютер = Параметры.ИмяКомпьютера;
	ВРМ.Пользователь = Параметры.ИмяПользователя;
	
КонецПроцедуры // ЗагрузитьВРМ()

// Добавить результат теста
//
// Параметры:
//  Контекст - Структура, контекст тестирования отдельного ВРМ
//             (см. СоздатьКонтекстВыполненияОбработки())
//  Показатель - Строка, имя показателя
//  Значение - Число, новое значение показателя
//
Процедура ДобавитьРезультат(Контекст, Показатель, Значение) Экспорт
	
	Значения = Контекст.Результаты[Показатель];
	
	Если Значения = Неопределено Тогда
		Значения = Новый Массив;
		Контекст.Результаты[Показатель] = Значения;
	КонецЕсли;
	
	Значения.Добавить(Значение);
	
КонецПроцедуры // ДобавитьРезультат()

// Записывает замеры длительности операций через подсистему "БСП.ОценкаПроизводительности" или "ЗамерыПроизводительности"
//
Процедура ЗаписатьРезультатыОценкиПроизводительности() Экспорт
	
	Попытка
		МодульОценкаПроизводительностиКлиент = Вычислить("ОценкаПроизводительностиКлиент");
	Исключение
		МодульОценкаПроизводительностиКлиент = Неопределено;
	КонецПопытки;
	
	#Если ВебКлиент Тогда
		ЭтоВебКлиент  = Истина;
	#Иначе
		ЭтоВебКлиент  = Ложь;
	#КонецЕсли	
	
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияПлатформы = СисИнфо.ВерсияПриложения;
	
	Если ЭтоВебКлиент И ТЦОбщий.СравнитьВерсии(ВерсияПлатформы, "8.3.3.641") < 0 Тогда
		Если МодульОценкаПроизводительностиКлиент = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Если МодульОценкаПроизводительностиКлиент = Неопределено
			ИЛИ ТипЗнч(МодульОценкаПроизводительностиКлиент) <> Тип("ОбщийМодуль") Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		МодульОценкаПроизводительностиКлиент.ЗаписатьРезультатыАвтоНеГлобальный();
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "ВРМ");
	КонецПопытки;
	
КонецПроцедуры // ЗаписатьРезультатыОценкиПроизводительности()

//////////////////////////////////////////////////////////////////////////////////////
// КЛИЕНТСКОЕ ПРИЛОЖЕНИЕ

&НаКлиенте
// Запустить опрос получения роли из справочника ТЦУправлениеТестом
//
Процедура ЗапуститьОпросОпределенияТипаПриложения() Экспорт
	
	#Если Не ВебКлиент Тогда
		ИмяКомпьютера = ИмяКомпьютера();
	#Иначе
		СистИнфо = Новый СистемнаяИнформация;
		ИмяКомпьютера = СистИнфо.ИдентификаторКлиента;
	#КонецЕсли
	
	ЭтоВРМ = Ложь;
	НазначенаРольПриСтарте = ТЦСервер.ИнициализироватьУправлениеТестом(ИмяКомпьютера, ПолучитьТекущуюСредуВыполнения(), ЭтоВРМ);
	
	Если НЕ ЭтоВРМ Тогда
		ТЦКлиент.ПереключитьРежимОпроса(НазначенаРольПриСтарте);
	КонецЕсли;
	
КонецПроцедуры //ЗапуститьОпросОпределенияТипаПриложения()

// Процедура на сервере для обработчика ОпросУправленияТестомДляРолей
Функция ВыполнитьОпросУправленияТестомДляРолей() Экспорт
	
	Результат = ТЦСервер.ПолучитьЗаписьУправленияТестомПоИдентификатору();
	ТипПриложения = ТЦСервер.ПолучитьТипПриложенияПоИдентификатору();
	
	ТЦСервер.УстановитьТипКлиентскогоПриложения(ТипПриложения);
	Если ТипПриложения = ПредопределенноеЗначение("Перечисление.ТЦТипКлиентскогоПриложения.УправлениеТестом") Тогда
		// логика работы клиента для типа УправлениеТестом
		ПроверкаДляТипаУправлениеТестом(Результат);
	ИначеЕсли ТипПриложения = ПредопределенноеЗначение("Перечисление.ТЦТипКлиентскогоПриложения.АгентТЦ") Тогда
		ПроверкаДляТипаАгентТЦ(Результат);
	ИначеЕсли Не ЗначениеЗаполнено(ТипПриложения) Тогда
		// Если роль не назначена, то переходим в режим ожидания
		ПереключитьРежимОпроса(Ложь);
	КонецЕсли;
	Возврат ТипПриложения;
	
КонецФункции //УстановитьИдКлиентскогоПриложения	

// Проверка для клиентского приложения с типом Управление Тестом
//
// Параметры:
//  Запись - СправочникСсылка.ТЦУправлениеТестом
//
Процедура ПроверкаДляТипаУправлениеТестом(Запись)  Экспорт
	
	ЭлементСценария = ТЦСервер.ПолучитьСценарий(Запись);
	ПараметрыВыполнения = ТЦСервер.ПолучитьПараметрыСценария(Запись);
	
	Если ЗначениеЗаполнено(ЭлементСценария) Тогда
		ФормаСостояниеТестирование = ТЦКлиент.ПолучитьФормуСостояниеТестирования();
		Если ФормаСостояниеТестирование.Открыта() Тогда
			ФормаСостояниеТестирование.Закрыть();
		КонецЕсли;
		
		П = Новый Структура;
		П.Вставить("ПараметрыВыполненияДляВебСервиса", ПараметрыВыполнения);
		
		Форма = ОткрытьФорму("Справочник.ТЦСценарии.ФормаСписка", П);
		Форма.Элементы.Список.ТекущаяСтрока = ЭлементСценария;
		Форма.ВыполнитьСценарий(Истина);
		Форма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

// Проверка для клиентского приложения с типом АгентТЦ
//
Процедура ПроверкаДляТипаАгентТЦ(Запись)  Экспорт

	Если ТЦСервер.ЗавершатьАгента(Запись) Тогда
		ЗавершитьРаботуСистемы(Истина);
	КонецЕсли;

КонецПроцедуры //ПроверкаДляТипаАгентТЦ

// Переключение состояния обработчиков
Процедура ПереключитьРежимОпроса(РольНазначена) Экспорт
	
	Если РольНазначена Тогда
		ОтключитьОбработчикОжидания("ОпросУправленияТестомПоИд");
		ПодключитьОбработчикОжидания("ОпросУправленияТестомДляРолей", ТЦСервер.ПолучитьИнтервалОпроса());
	Иначе
		ОтключитьОбработчикОжидания("ОпросУправленияТестомДляРолей");
		ПодключитьОбработчикОжидания("ОпросУправленияТестомПоИд", ТЦСервер.ПолучитьИнтервалОпроса());
	КонецЕсли;
	
КонецПроцедуры

// Проверка типа запущенного клиента
//
Функция ПолучитьТекущуюСредуВыполнения() Экспорт 

	#Если ТолстыйКлиентОбычноеПриложение Тогда 
		Возврат ПредопределенноеЗначение("Перечисление.ТЦТипКлиента.ТолстыйОбычный");
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение  Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТЦТипКлиента.ТолстыйУправляемый");
	#ИначеЕсли ТонкийКлиент Тогда  
		Возврат ПредопределенноеЗначение("Перечисление.ТЦТипКлиента.Тонкий1С");
	#ИначеЕсли ВебКлиент Тогда 
		Возврат ПредопределенноеЗначение("Перечисление.ТЦТипКлиента.ТонкийВеб");
	#Иначе
		Возврат ПредопределенноеЗначение("Перечисление.ТЦТипКлиента.ПустаяСсылка");
	#КонецЕсли

КонецФункции//ПолучитьТекущуюСредуВыполнения

// Получить порт агента на текущем компьютере
//
// Параметры:
//  АдресЛокальногоПодключения - Строка, см. АдресЛокальногоПодключения()
//
// Возвращаемое значение:
//  Строка - номер порта агента на этом компьютере в этой сессии
//
Функция ЛокальныйПортАгента(НомерСессии = Неопределено) Экспорт
	
	// Назначим локальный порт агенту, учтем, что несколько агентов может выполняться на одном компьютере.
	Если НомерСессии = Неопределено Тогда
		Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
		НомерСессии = КипВнешнийКомпонент.НомерСессии(Инструменты);
		ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	КонецЕсли;
	
	ПортАгента = ТЦСервер.ПолучитьПортАгента(ИмяКомпьютера, НомерСессии);
	
	Возврат ПортАгента;
	
КонецФункции // ЛокальныйАдресАгента()
